Courses/7140/Projects/7140-homework-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Adv Software Eng: HW1 Spring 2017</title>
<!-- 2017-04-03 Mon 08:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CS7140 Software Engineering Lecture"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../Top/index.html"> UP </a>
 |
 <a accesskey="H" href="../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../Top/">CS 7140</a>
</div>
<div id="content">
<h1 class="title">Adv Software Eng: HW1 Spring 2017</h1>
<p>
Home work in this course is done individually, without help from
others.  The due date is announced on the course home page.
</p>

<p>
In this HW1, we are focussed on the <del>SOLID principles of OOD, and in
particular on</del> Design by Contract and use of Assertions.
</p>

<p>
The numbers in parens indicate relative importance of subtopics.  Do
not expect them to add upto a 100.
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Improve OOD C++</h2>
<div class="outline-text-2" id="text-1">
<p>
[45 points] [Improve OOD] [C++] The file <a href="../Lectures/Examples/Worms/worms-one-file.cpp.html">worms.cpp colorized</a> |
<a href="../Lectures/Examples/Worms/worms-one-file.cpp">worms.cpp plain</a> implements a grass roots game example of wiggly worms
(scissor heads, cannibals, or vegetarian kind) moving about.
Additional Notes in the pages at <a href="../Lectures/Examples/Worms/">Worms</a>.
</p>

<ol class="org-ol">
<li>(40) Revise it so that it is in "proper" OOP form.  Describe the end
result and the changes made in a brief tech report.
</li>
<li>(60) Write entry- and exit-assertions for all the methods, and class
invariants.  You may ignore assertions relating to
<code>ncurses.h</code>.
</li>
<li>(20) The design and code-as-given does not "really" do anything
about the z-axis.  Suggest ideas and implement.
</li>
<li>(00) It probably has bugs.  Feel free to ignore its bugs (that is,
you are not expected to fix bugs).  If you can, identify them!
</li>
<li>(10) Write one or two paragraphs reporting on how you discovered and
revised the classes, and on your experince with the tools you
used to carry out this assignment.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Improve OOD Java</h2>
<div class="outline-text-2" id="text-2">
<p>
[45 points] [Java8] [JavaFX] [Threads] [Testing] Read about the Game
of Life by Conway on the wikipedia.
</p>

<ol class="org-ol">
<li>(40) Design and implement in Java an elegant looking GoL program.
Google Play has several Android APKs.  Use the source code of
<a href="http://www.bitstorm.org/gameoflife/">http://www.bitstorm.org/gameoflife/</a>. Or not.
</li>

<li>(60) Write entry- and exit-assertions for all (well, longer than 10
lines) the methods, and all class invariants.
</li>

<li>(30) Outline a rigorous (executable?) specification that every GoL
program should satisfy.
</li>

<li>(40) Many GoL programs fail to implement the game properly.
Particularly, the concurrency and the infinite grid parts.  How do
we devise a test plan to check that well-known example patterns are
done right?  Present an executable solution.
</li>

<li>(10) Must build cleanly with the latest Java8 + JavaFX.  Note that
Java9 is around the corner.  You are welcome to use an alternative
instead of JavaFX.  But then include an articulation of why.
</li>

<li>(10) Write one or two paragraphs reporting on how you discovered and
revised the classes, and on your experience with the tools you used
to carry out this assignment.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Bonus</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>[25 points Bonus] The worms program did not use threads. Make the
best of threads to improve the "look and feel" and revise your
answers to 1.1 through 1.5.  [Bonus points help only when you are
just below a grading curve.  At the discretion of your instructor.]
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Journal</h2>
<div class="outline-text-2" id="text-4">
<p>
[10 Easy-to-Earn Points] Please maintain a journal for this homework.
Submit a summary.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Turn In</h2>
<div class="outline-text-2" id="text-5">
<p>
Follow all ethical/ scholary traditions of attribution.
</p>

<p>
Include screenshots.  Other than the source code files, put everything
else together and produce <b>one</b> PDF file.
</p>

<p>
The file hw1.tar.bzip2 should be a compressed tar ball of all the files
related to this homework.  Include the revised/ original source code
files so that everything builds cleanly.  I expect to see
subdirectories for each problem.  I expect to be able to build all
the programs by invoking <code>make</code> at the top level.
</p>

<p>
On <code>thor.cs.wright.edu</code> invoke <code>~cs714000/turnin Homework1 hw1.tar.bzip2
hw1.pdf</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2017-03-08
</div>
</body>
</html>
